## 前言
本文是对SWIFT 22年9月13日新闻[《SWIFT为消除公司行为信息摩擦的创新》](https://www.swift.com/news-events/news/swift-innovates-remove-friction-corporate-actions)的笔记。

## 背景
上市公司的重大事项信息（如股利分配、债转股、合并、拍卖），需要尽快传递给投资人、债权人及其他利益相关方。
这个信息的传递过程是复杂的，复杂性来源于
1. 投资链路有多个中间人，如中央证券托管机构、本地或全球的托管银行、基金经理、支付代理，等等
2. 信息接收方通常会从多个上游获取到相同的事件，但不同上游采用不同信息标准，且可能有数据缺失、矛盾、不准确的问题
因此信息流下游需要投入人力清洗数据，人力清洗占公司事件处理业务30%成本。

## SWIFT的创新方案
尝试使用Symbiont公司的Assembly智能合约平台，自动清洗不同来源的事件信息。
处理流程：事件信息通过SWIFT消息传递。由应用SWIFT Translator转换消息，并上传至区块链。区块链智能合约对比不同来源的同一事件信息，标注出不一致。
方案优点：快速、流程透明可审计、减少人力投入、避免人工失误风险。

## 我的看法
上市公司的重大事项信息，特点是高时效性，针对特定受众具有高价值，是公开的公共数据。
SWIFT的这个创新方案，运用了智能合约可编程、区块链可审计的特点，关键目标是消除数据流的人工清洗，提高处理效率。
